modm-ext/data.modm.io/docs/svd/header_stm32u5f7xx.svd
        <register>
          <name>CTR215</name>
          <description>DMA channel x transfer register 2</description>
          <addressOffset>0x814</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REQSEL</name>
              <description>DMA hardware request selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>SWREQ</name>
              <description>Software request</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DREQ</name>
              <description>Destination hardware request</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BREQ</name>
              <description>Block hardware request</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRIGM</name>
              <description>Trigger mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TRIGSEL</name>
              <description>Trigger event input selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>TRIGPOL</name>
              <description>Trigger event polarity</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TCEM</name>
              <description>Transfer complete event mode</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CBR115</name>
          <description>DMA channel x block register 1</description>
          <addressOffset>0x818</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BNDT</name>
              <description>Block number of data bytes to transfer from the source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>BRC</name>
              <description>Block repeat counter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>SDEC</name>
              <description>Source address decrement</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DDEC</name>
              <description>Destination address decrement</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRSDEC</name>
              <description>Block repeat source address decrement</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRDDEC</name>
              <description>Block repeat destination address decrement</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSAR15</name>
          <description>DMA channel x source address register</description>
          <addressOffset>0x81c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SA</name>
              <description>Source Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CDAR15</name>
          <description>DMA channel x destination address register</description>
          <addressOffset>0x820</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DA</name>
              <description>Destination address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTR315</name>
          <description>DMA channel x transfer register 3</description>
          <addressOffset>0x824</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAO</name>
              <description>Source address offset increment</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>DAO</name>
              <description>Destination address offset increment</description>
              <bitOffset>16</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CBR215</name>
          <description>DMA channel x block register 2</description>
          <addressOffset>0x828</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BRSAO</name>
              <description>Block repeated source address offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>BRDAO</name>
              <description>Block repeated destination address offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLLR15</name>
          <description>DMA channel x linked-list address register</description>
          <addressOffset>0x84c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LA</name>
              <description>Pointer to the next linked-list data structure</description>
              <bitOffset>2</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
            <field>
              <name>ULL</name>
              <description>Update link address register from memory</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UB2</name>
              <description>Update block register 2 from memory</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UT3</name>
              <description>Update transfer register 3 from SRAM</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UDA</name>
              <description>Update destination address register from SRAM</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USA</name>
              <description>Update source address register from SRAM</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UB1</name>
              <description>Update block register 1 from SRAM</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UT2</name>
              <description>Update transfer register 2 from SRAM</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UT1</name>
              <description>Update transfer register 1 from SRAM</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
