modm-ext/data.modm.io/docs/svd/header_stm32u5f7xx.svd
        <register>
          <name>QMEM23</name>
          <description>JPEG quantization tables 2</description>
          <addressOffset>0xdc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM24</name>
          <description>JPEG quantization tables 2</description>
          <addressOffset>0xe0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM25</name>
          <description>JPEG quantization tables 2</description>
          <addressOffset>0xe4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM26</name>
          <description>JPEG quantization tables 2</description>
          <addressOffset>0xe8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM27</name>
          <description>JPEG quantization tables 2</description>
          <addressOffset>0xec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM28</name>
          <description>JPEG quantization tables 2</description>
          <addressOffset>0xf0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM29</name>
          <description>JPEG quantization tables 2</description>
          <addressOffset>0xf4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM210</name>
          <description>JPEG quantization tables 2</description>
          <addressOffset>0xf8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM211</name>
          <description>JPEG quantization tables 2</description>
          <addressOffset>0xfc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM212</name>
          <description>JPEG quantization tables 2</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM213</name>
          <description>JPEG quantization tables 2</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM214</name>
          <description>JPEG quantization tables 2</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM215</name>
          <description>JPEG quantization tables 2</description>
          <addressOffset>0x10c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM30</name>
          <description>JPEG quantization tables 3</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM31</name>
          <description>JPEG quantization tables 3</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM32</name>
          <description>JPEG quantization tables 3</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM33</name>
          <description>JPEG quantization tables 3</description>
          <addressOffset>0x11c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM34</name>
          <description>JPEG quantization tables 3</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM35</name>
          <description>JPEG quantization tables 3</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM36</name>
          <description>JPEG quantization tables 3</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM37</name>
          <description>JPEG quantization tables 3</description>
          <addressOffset>0x12c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM38</name>
          <description>JPEG quantization tables 3</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM39</name>
          <description>JPEG quantization tables 3</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM310</name>
          <description>JPEG quantization tables 3</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM311</name>
          <description>JPEG quantization tables 3</description>
          <addressOffset>0x13c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM312</name>
          <description>JPEG quantization tables 3</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM313</name>
          <description>JPEG quantization tables 3</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM314</name>
          <description>JPEG quantization tables 3</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM315</name>
          <description>JPEG quantization tables 3</description>
          <addressOffset>0x14c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN0</name>
          <description>JPEG HuffMin tables</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN1</name>
          <description>JPEG HuffMin tables</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN2</name>
          <description>JPEG HuffMin tables</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN3</name>
          <description>JPEG HuffMin tables</description>
          <addressOffset>0x15c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN4</name>
          <description>JPEG HuffMin tables</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN5</name>
          <description>JPEG HuffMin tables</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN6</name>
          <description>JPEG HuffMin tables</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN7</name>
          <description>JPEG HuffMin tables</description>
          <addressOffset>0x16c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN8</name>
          <description>JPEG HuffMin tables</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN9</name>
          <description>JPEG HuffMin tables</description>
          <addressOffset>0x174</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN10</name>
          <description>JPEG HuffMin tables</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN11</name>
          <description>JPEG HuffMin tables</description>
          <addressOffset>0x17c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN12</name>
          <description>JPEG HuffMin tables</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN13</name>
          <description>JPEG HuffMin tables</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN14</name>
          <description>JPEG HuffMin tables</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN15</name>
          <description>JPEG HuffMin tables</description>
          <addressOffset>0x18c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE0</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE1</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE2</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE3</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x19c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE4</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE5</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE6</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE7</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE8</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE9</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE10</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE11</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE12</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE13</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE14</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE15</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE16</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE17</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE18</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE19</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE20</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE21</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE22</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE23</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE24</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE25</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE26</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE27</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x1fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE28</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE29</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE30</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE31</name>
          <description>JPEG HuffSymb tables</description>
          <addressOffset>0x20c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>84</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>HUFFSYMB[%s]</name>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>103</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DHTMEM[%s]</name>
          <addressOffset>0x360</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>88</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>HUFFENC_AC0[%s]</name>
          <addressOffset>0x500</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>88</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>HUFFENC_AC1[%s]</name>
          <addressOffset>0x660</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC00</name>
          <description>JPEG encodor, DC Huffman table 0</description>
          <addressOffset>0x7c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC01</name>
          <description>JPEG encodor, DC Huffman table 0</description>
          <addressOffset>0x7c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC02</name>
          <description>JPEG encodor, DC Huffman table 0</description>
          <addressOffset>0x7c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC03</name>
          <description>JPEG encodor, DC Huffman table 0</description>
          <addressOffset>0x7cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC04</name>
          <description>JPEG encodor, DC Huffman table 0</description>
          <addressOffset>0x7d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC05</name>
          <description>JPEG encodor, DC Huffman table 0</description>
          <addressOffset>0x7d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC06</name>
          <description>JPEG encodor, DC Huffman table 0</description>
          <addressOffset>0x7d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC07</name>
          <description>JPEG encodor, DC Huffman table 0</description>
          <addressOffset>0x7dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC10</name>
          <description>JPEG encodor, DC Huffman table 1</description>
          <addressOffset>0x7e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC11</name>
          <description>JPEG encodor, DC Huffman table 1</description>
          <addressOffset>0x7e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC12</name>
          <description>JPEG encodor, DC Huffman table 1</description>
          <addressOffset>0x7e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC13</name>
          <description>JPEG encodor, DC Huffman table 1</description>
          <addressOffset>0x7ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC14</name>
          <description>JPEG encodor, DC Huffman table 1</description>
          <addressOffset>0x7f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC15</name>
          <description>JPEG encodor, DC Huffman table 1</description>
          <addressOffset>0x7f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC16</name>
          <description>JPEG encodor, DC Huffman table 1</description>
          <addressOffset>0x7f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC17</name>
          <description>JPEG encodor, DC Huffman table 1</description>
          <addressOffset>0x7fc</addressOffset>
          <size>0x20</size>
        </register>
